In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'name':['John James Smith', 'Mary Ann Goldman'],
                   'location':['Los Angeles, CA', 'Washington, DC']})
df

               name         location
0  John James Smith  Los Angeles, CA
1  Mary Ann Goldman   Washington, DC

In [3]:
df.name.str.split(' ', expand=True)

      0      1        2
0  John  James    Smith
1  Mary    Ann  Goldman

In [4]:
df[['first', 'middle', 'last']] = df.name.str.split(' ', expand=True)
df

               name         location first middle     last
0  John James Smith  Los Angeles, CA  John  James    Smith
1  Mary Ann Goldman   Washington, DC  Mary    Ann  Goldman

In [5]:
df.location.str.split(', ', expand=True)

             0   1
0  Los Angeles  CA
1   Washington  DC

In [6]:
df['city'] = df.location.str.split(', ', expand=True)[0]
df

               name         location first middle     last         city
0  John James Smith  Los Angeles, CA  John  James    Smith  Los Angeles
1  Mary Ann Goldman   Washington, DC  Mary    Ann  Goldman   Washington